<a href="https://colab.research.google.com/github/barkhakabra24/Employee_Management_System/blob/master/BasicPython.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
data = sns.load_dataset('tips')
data.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [6]:
day = data.groupby('day')['total_bill']
print(list(day))

[('Thur', 77     27.20
78     22.76
79     17.29
80     19.44
81     16.66
       ...
202    13.00
203    16.40
204    20.53
205    16.47
243    18.78
Name: total_bill, Length: 62, dtype: float64), ('Fri', 90     28.97
91     22.49
92      5.75
93     16.32
94     22.75
95     40.17
96     27.28
97     12.03
98     21.01
99     12.46
100    11.35
101    15.38
220    12.16
221    13.42
222     8.58
223    15.98
224    13.42
225    16.27
226    10.09
Name: total_bill, dtype: float64), ('Sat', 19     20.65
20     17.92
21     20.29
22     15.77
23     39.42
       ...
238    35.83
239    29.03
240    27.18
241    22.67
242    17.82
Name: total_bill, Length: 87, dtype: float64), ('Sun', 0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
       ...
186    20.90
187    30.46
188    18.15
189    23.10
190    15.69
Name: total_bill, Length: 76, dtype: float64)]

In [12]:
day = data.groupby('day')['total_bill'].sum()
print(day)

day
Thur    1096.33
Fri      325.88
Sat     1778.40
Sun     1627.16
Name: total_bill, dtype: float64

In [11]:
day = data.groupby('day')['total_bill'].sum().reset_index()
print(day)

    day  total_bill
0  Thur     1096.33
1   Fri      325.88
2   Sat     1778.40
3   Sun     1627.16